# MySQL 8.0 Reference Manual

## Basic Steps for MySQL Server Deployment with Docker

### Starting a MySQL Server Instance

MySQL docker official image

In [ ]:
!docker run --name=mysql1 -p 3306:3306 -e MYSQL_ROOT_PASSWORD=mysqlpass -d mysql

MySQL docker Oracle image
```
docker run --name=mysql1 -p 3306:3306 -e MYSQL_ROOT_PASSWORD=mysqlpass -d mysql/mysql-server
```

### Connecting to MySQL Server from within the Container

```
docker exec -it mysql1 mysql -uroot -pmysqlpass
```

### Container Shell Access

```
docker exec -it mysql1 bash 
```

### Stopping and Deleting a MySQL Container

```
docker stop mysql1
```

```
docker restart mysql1
```

```
docker rm mysql1
```

## Tutorial

### Connecting to and Disconnecting from the Server

```
mysql -u root -p
```

In [1]:
from sqlalchemy import create_engine, inspect, Table, Column, String, Integer, ForeignKey, MetaData, CHAR, VARCHAR, DATE, select, desc, func, text
from sqlalchemy.sql import and_, or_, not_, alias
from sqlalchemy.dialects.mysql import INTEGER, DECIMAL
import pandas as pd

In [2]:
engine = create_engine('mysql+pymysql://root:mysqlpass@localhost', pool_recycle=3600)
conn = engine.connect()

In [ ]:
def query(s):
    result = conn.execute(s)
    for row in result:
        print(row)

### Creating and Selecting a Database

```sql
SHOW DATABASES;
```

In [ ]:
def get_dbs():
    insp = inspect(engine)
    dbs = insp.get_schema_names()
    print(dbs)
    
get_dbs()

```sql
CREATE DATABASE menagerie;
```

In [ ]:
def set_queries(queries):
    for query in queries:
        result = conn.execute(query)
      
queries = [
    'DROP DATABASE IF EXISTS menagerie;',
    'CREATE DATABASE menagerie;'
]

set_queries(queries)

get_dbs()

In [4]:
conn.close()

In [ ]:
engine = create_engine('mysql+pymysql://root:mysqlpass@localhost/menagerie', pool_recycle=3600)
conn = engine.connect()

### Creating a Table

```sql
SHOW TABLES;
```

In [ ]:
def show_tables():
    print(engine.table_names())
    
show_tables()

```sql
CREATE TABLE pet (
    name VARCHAR(20), 
    owner VARCHAR(20),
    species VARCHAR(20), 
    sex CHAR(1), 
    birth DATE, 
    death DATE
);
```

In [ ]:
meta = MetaData()

pet = Table('pet', meta,
            Column('name', VARCHAR(20)),
            Column('owner', VARCHAR(20)),
            Column('species', VARCHAR(20)),
            Column('sex', CHAR(1)),
            Column('birth', DATE),
            Column('death', DATE)
           )
       
pet.create(engine)
show_tables()

```sql
DESCRIBE pet;
```

In [ ]:
print(meta.tables)

## Loading Data into a Table

```sql
INSERT INTO pet VALUES 
    ('Fluffy',   'Harold',   'cat',      'f',    '1993-02-04',   NULL),
    ('Claws',    'Diane',    'cat',      'm',    '1994-03-17',   NULL),
    ('Buffy',    'Harold',   'dog',      'f',    '1989-05-13',   NULL),
    ('Fang',     'Benny',    'dog',      'm',    '1990-08-27',   NULL),
    ('Bowser',   'Diane',    'dog',      'm',    '1979-08-31',   '1995-07-29'),
    ('Chirpy',   'Gwen',     'bird',     'f',    '1998-09-11',   NULL),
    ('Whistler', 'Gwen',     'bird',     NULL,   '1997-12-09',   NULL),
    ('Slim',     'Benny',    'snake',    'm',    '1996-04-29',   NULL),
    ('Puffball', 'Diane',    'hamster',  'f',    '1999-03-30',   NULL);
```

In [ ]:
cols = [str(col).split('.')[1] for col in pet.columns]

ins_data = [
    ['Fluffy',	    'Harold',   'cat',	    'f',	'1993-02-04',	None],
    ['Claws',	    'Gwen',     'cat',	    'm',	'1994-03-17',	None],
    ['Buffy',	    'Harold',	'dog',	    'f',	'1989-05-13',	None],
    ['Fang',	    'Benny',	'dog',	    'm',	'1990-08-27',	None],
    ['Bowser',	    'Diane',	'dog',	    'm',	'1979-08-31',	'1995-07-29'],
    ['Chirpy',	    'Gwen',     'bird',	    'f',	'1998-09-11',	None],
    ['Whistler',    'Gwen',     'bird',	    None,	'1997-12-09',	None],
    ['Slim',	    'Benny',	'snake',	'm',	'1996-04-29',	None],
    ['Puffball',    'Diane',	'hamster',	'f',	'1999-03-30',	None]
]

data = [{col: d for col, d in zip(cols, ds)} for ds in ins_data]
result = conn.execute(pet.insert(), data)

### Selecting All Data

```sql
SELECT * FROM pet;
```

In [ ]:
s = select([pet])
query(s)

```sql
UPDATE pet SET birth = '1989-08-31' WHERE name = 'Bowser';
```

In [ ]:
stmt = pet.update().\
            where(pet.c.name == 'Bowser').\
            values(birth = '1989-08-31')
result = conn.execute(stmt)

### Selecting Particular Rows

```sql
SELECT * FROM pet WHERE name = 'Bowser';
```

In [ ]:
s = select([pet]).where(pet.c.name == 'Bowser')
query(s)

```sql
SELECT * FROM pet WHERE birth >= '1998-1-1';
```

In [ ]:
s = select([pet]).where(pet.c.birth >= '1998-1-1')
query(s)

```sql
SELECT * FROM pet WHERE species = 'dog' AND sex = 'f';
```

In [ ]:
s = select([pet]).\
    where(
        and_(pet.c.species == 'dog', pet.c.sex == 'f')
        )
query(s)

```sql
SELECT * 
FROM pet 
WHERE species = 'snake' OR species = 'bird';
```

In [ ]:
s = select([pet]).\
    where(
        or_(pet.c.species == 'snake', pet.c.species == 'bird')
        )
query(s)

```sql
SELECT * 
FROM pet 
WHERE (species = 'cat' AND sex = 'm') OR (species = 'dog' AND sex = 'f');
```

In [ ]:
s = select([pet]).\
    where(
        or_(
            and_(pet.c.species == 'cat', pet.c.sex == 'm'
                ),
            and_(pet.c.species == 'dog', pet.c.sex == 'f'
                )
            )
        )
query(s)

### Selecting Particular Columns

```sql
SELECT name, birth 
FROM pet;
```

In [ ]:
s = select([pet.c.name, pet.c.birth])
query(s)

```sql
SELECT owner 
FROM pet;
```

In [ ]:
s = select([pet.c.owner])
query(s)

```sql
SELECT DISTINCT owner 
FROM pet;
```

In [ ]:
s = select([pet.c.owner]).distinct()
query(s)

```sql
SELECT name, species, birth 
FROM pet 
WHERE species = 'dog' OR species = 'cat';
```

In [ ]:
s = select([pet.c.name, pet.c.species, pet.c.birth]).\
        where(
            or_(pet.c.species == 'dog', pet.c.species == 'cat')
            )  
query(s)

### Sorting Rows

```sql
SELECT name, birth 
FROM pet 
ORDER BY birth;
```

In [ ]:
s = select([pet.c.name, pet.c.birth]).order_by('birth')     
query(s)

```sql
SELECT name, birth 
FROM pet 
ORDER BY birth DESC;
```

In [ ]:
s = select([pet.c.name, pet.c.birth]).order_by(desc('birth'))     
query(s)

```sql
SELECT name, species, birth 
FROM pet 
ORDER BY species, birth DESC;
```

In [ ]:
s = select([pet.c.name, pet.c.species, pet.c.birth]).order_by('species', desc('birth'))     
query(s)

### Date Calculations

```sql
SELECT name, birth, CURDATE(), TIMESTAMPDIFF(YEAR,birth,CURDATE()) AS age 
FROM pet;
```

In [ ]:
s = select([pet.c.name, pet.c.birth, func.curdate(), func.timestampdiff(text('YEAR'), pet.c.birth, func.curdate())])   
query(s)

```sql
SELECT name, birth, CURDATE(), TIMESTAMPDIFF(YEAR,birth,CURDATE()) AS age 
FROM pet
ORDER BY name;
```

In [ ]:
s = select([pet.c.name, pet.c.birth, func.curdate(), func.timestampdiff(text('YEAR'), pet.c.birth, func.curdate()).label('age')]).order_by('name')   
query(s)

```sql
SELECT name, birth, CURDATE(), TIMESTAMPDIFF(YEAR,birth,CURDATE()) AS age 
FROM pet
ORDER BY age;
```

In [ ]:

s = select([pet.c.name, pet.c.birth, func.curdate(), func.timestampdiff(text('YEAR'), pet.c.birth, func.curdate()).label('age')]).order_by('age')
query(s)

```sql
SELECT name, birth, death, TIMESTAMPDIFF(YEAR,birth,death) AS age 
FROM pet
WHERE death IS NOT NULL
ORDER BY age;
```

In [ ]:
s = select([pet.c.name, pet.c.birth, pet.c.death, func.timestampdiff(text('YEAR'), pet.c.birth, pet.c.death).label('age')]).\
    where(pet.c.death != None).order_by('age')
query(s)

```sql
SELECT name, birth, MONTH(birth) 
FROM pet;
```

In [ ]:
s = select([pet.c.name, pet.c.birth, func.month(pet.c.birth)])
query(s)

```sql
SELECT name, birth 
FROM pet 
WHERE MONTH(birth) = 5;
```

In [ ]:
s = select([pet.c.name, pet.c.birth]).\
        where(func.month(pet.c.birth) == 5)
query(s)

### Pattern Matching

To find names beginning with b:

```sql
SELECT * 
FROM pet 
WHERE name LIKE 'b%';
```

In [ ]:
s = select([pet]).\
        where(pet.c.name.like('b%'))
query(s)

To find names ending with fy:

```sql
SELECT * 
FROM pet 
WHERE name LIKE '%fy';
```

In [ ]:
s = select([pet]).\
        where(pet.c.name.like('%fy'))
query(s)

To find names containing a w

```sql
SELECT * 
FROM pet 
WHERE name LIKE '%w%';
```

In [ ]:
s = select([pet]).\
        where(pet.c.name.like('%w%'))
query(s)

To find names containing exactly five characters, use five instances of the _ pattern character:

```sql
SELECT * 
FROM pet 
WHERE name LIKE '%w%';
```

In [ ]:
s = select([pet]).\
        where(pet.c.name.like('_____'))
query(s)

To find names beginning with b, use ^ to match the beginning of the name:

```sql
SELECT * 
FROM pet 
WHERE REGEXP_LIKE(name, '^b');
```

In [ ]:
s = select([pet]).\
        where(func.regexp_like(pet.c.name, '^b'))
query(s)

To find names ending with `fy`, use `$` to match the end of the name:

```sql
SELECT * 
FROM pet 
WHERE REGEXP_LIKE(name, 'fy%');
```

In [ ]:
s = select([pet]).\
        where(func.regexp_like(pet.c.name, 'fy$'))
query(s)

To find names containing a `w`, use this query:

```sql
SELECT * 
FROM pet 
WHERE REGEXP_LIKE(name, 'w');
```

In [ ]:
s = select([pet]).\
        where(func.regexp_like(pet.c.name, 'w'))
query(s)

To find names containing exactly five characters, use `^` and `$` to match the beginning and end of the name, and five instances of . in between:

```sql
SELECT * 
FROM pet 
WHERE REGEXP_LIKE(name, '^.....$');
```

In [ ]:
s = select([pet]).\
        where(func.regexp_like(pet.c.name, '^.....$'))
query(s)

You could also write the previous query using the {**n**} (“*repeat-**n**-times*”) operator:

```sql
SELECT * 
FROM pet 
WHERE REGEXP_LIKE(name, '^.....$');
```

In [ ]:
s = select([pet]).\
        where(func.regexp_like(pet.c.name, '^.{5}$'))
query(s)

### Counting Rows

```sql
SELECT COUNT(*) FROM pet;
```

In [ ]:
s = select([func.count()]).select_from(pet)
query(s)

```sql
SELECT owner, COUNT(*) 
FROM pet 
GROUP BY owner;
```

In [ ]:
s = select([pet.c.owner, func.count()]).group_by('owner')
query(s)

Number of animals per species:

```sql
SELECT species, COUNT(*) 
FROM pet 
GROUP BY species;
```

In [ ]:
s = select([pet.c.species, func.count()]).group_by('species')
query(s)

Number of animals per sex:

```sql
SELECT sex, COUNT(*) 
FROM pet 
GROUP BY sex;
```

In [ ]:
s = select([pet.c.sex, func.count()]).group_by('sex')
query(s)

Number of animals per combination of species and sex:

```sql
SELECT species, sex, COUNT(*) 
FROM pet 
GROUP BY species, sex;
```

In [ ]:
s = select([pet.c.species, pet.c.sex, func.count()]).group_by('species', 'sex')
query(s)

```sql
SELECT species, sex, COUNT(*) FROM pet
WHERE species = 'dog' OR species = 'cat'
GROUP BY species, sex;
```

In [ ]:
s = select([pet.c.species, pet.c.sex, func.count()]).\
        where(or_(pet.c.species == 'dog', pet.c.species == 'cat')).\
        group_by('species', 'sex')
query(s)

```sql
SELECT species, sex, COUNT(*) FROM pet
WHERE sex IS NOT NULL
GROUP BY species, sex;
```

In [ ]:
s = select([pet.c.species, pet.c.sex, func.count()]).\
        where(pet.c.sex != None).\
        group_by('species', 'sex')
query(s)

### Using More Than one Table

```sql
CREATE TABLE event (
    name VARCHAR(20), 
    date DATE,
    type VARCHAR(15), 
    remark VARCHAR(255)
);
```

In [ ]:
meta = MetaData()

event = Table('event', meta,
            Column('name', VARCHAR(20)),
            Column('date', DATE),
            Column('type', VARCHAR(15)),
            Column('remark', VARCHAR(255))
           )
       
event.create(engine)
show_tables()

```sql
INSERT INTO event VALUES 
    ('Fluffy',	    '1995-05-15',   'litter',	'4 kittens, 3 female, 1 male'),
    ('Buffy',	    '1993-06-23',	'litter',	'5 puppies, 2 female, 3 male'),
    ('Buffy',	    '1994-06-19',	'litter',	'3 puppies, 3 female'),
    ('Chirpy',	    '1999-03-21',	'vet',      'needed beak straightened'),
    ('Slim',	    '1997-08-03',	'vet',	    'broken rib'),
    ('Bowser',	    '1991-10-12',	'kennel',   NULL),
    ('Fang',	    '1991-10-12',	'kennel',   NULL),
    ('Fang',	    '1998-08-28',	'birthday',	'Gave him a new chew toy'),
    ('Claws',	    '1998-03-17',	'birthday',	'Gave him a new flea collar'),
    ('Whistler',   '1998-12-09',	'birthday',	'First birthday');
```

In [ ]:
cols = [str(col).split('.')[1] for col in event.columns]

ins_data = [
    ['Fluffy',	    '1995-05-15',   'litter',   '4 kittens, 3 female, 1 male'],
    ['Buffy',	    '1993-06-23',	'litter',   '5 puppies, 2 female, 3 male'],
    ['Buffy',	    '1994-06-19',	'litter',   '3 puppies, 3 female'],
    ['Chirpy',	    '1999-03-21',	'vet',      'needed beak straightened'],
    ['Slim',	    '1997-08-03',	'vet',	    'broken rib'],
    ['Bowser',	    '1991-10-12',	'kennel',   None],
    ['Fang',	    '1991-10-12',	'kennel',   None],
    ['Fang',	    '1998-08-28',	'birthday', 'Gave him a new chew toy'],
    ['Claws',	    '1998-03-17',	'birthday', 'Gave him a new flea collar'],
    ['Whistler',    '1998-12-09',	'birthday', 'First birthday']
]

data = [{col: d for col, d in zip(cols, ds)} for ds in ins_data]
result = conn.execute(event.insert(), data)

In [ ]:
s = select([event])
query(s)

```sql
SELECT pet.name, TIMESTAMPDIFF(YEAR,birth,date) AS age, remark
FROM pet INNER JOIN event ON pet.name = event.name
WHERE event.type = 'litter';
```

In [ ]:
s = select([pet.c.name, func.timestampdiff(text('YEAR'), pet.c.birth, text('date')).label('age'), event.c.remark]).\
        select_from(pet.join(event, pet.c.name == event.c.name)).\
        where(event.c.type == 'litter')
query(s)

```sql
SELECT p1.name, p1.sex, p2.name, p2.sex, p1.species
FROM pet AS p1 INNER JOIN pet AS p2
ON p1.species = p2.species
AND p1.sex = 'f' AND p1.death IS NULL
AND p2.sex = 'm' AND p2.death IS NULL;
```

In [ ]:
p1 = pet.alias('p1')
p2 = pet.alias('p2')
s = select([p1.c.name, p1.c.sex, p2.c.name, p2.c.sex, p1.c.species]).\
        select_from(p1.join(p2, and_(
            p1.c.species == p2.c.species, and_(
                p1.c.sex == 'f', and_(
                    p1.c.death == None, and_(
                        p2.c.sex == 'm', p2.c.death == None))))))
query(s)

### Examples of Common Queries

```sql
CREATE TABLE shop (
    article INT UNSIGNED  DEFAULT '0000' NOT NULL,
    dealer  CHAR(20)      DEFAULT ''     NOT NULL,
    price   DECIMAL(16,2) DEFAULT '0.00' NOT NULL,
    PRIMARY KEY(article, dealer));
INSERT INTO shop VALUES
    (1,'A',3.45),(1,'B',3.99),(2,'A',10.99),(3,'B',1.45),
    (3,'C',1.69),(3,'D',1.25),(4,'D',19.95);
```

In [ ]:
meta = MetaData()

shop = Table('shop', meta,
            Column('article', INTEGER(unsigned=True), server_default='0000', primary_key=True),
            Column('dealer', CHAR(20), server_default='', primary_key=True),
            Column('price', DECIMAL(16,2), server_default='0.00', nullable=False)
           )
       
shop.create(engine)
show_tables()

raw_data = [
    [1, 'A', 3.45], [1, 'B', 3.99], [2, 'A', 10.99], [3, 'B', 1.45],
    [3, 'C', 1.69], [3, 'D', 1.25], [4, 'D', 19.95]
]

ins_data = [{col: data for col, data in zip(shop.c.keys(), row)} for row in raw_data]
result = conn.execute(shop.insert(), ins_data)

In [ ]:
s = select([shop])
query(s)

```sql
SELECT * FROM shop ORDER BY article;
```

In [ ]:
s = select([shop]).order_by('article')
query(s)

**The Maximum Value for a Column**

```sql
SELECT MAX(article) AS article FROM shop;
```

In [ ]:
s = select([func.max(shop.c.article).label('article')])
query(s)

**The Row Holding the Maximum of a Certain Column**

```sql
SELECT article, dealer, price
FROM   shop
WHERE  price=(SELECT MAX(price) FROM shop);
```

In [ ]:
s = select([shop.c.article, shop.c.dealer, shop.c.price]).\
        where(shop.c.price == (select([func.max(shop.c.price)])))
query(s)

```sql
SELECT article, dealer, price
FROM shop
ORDER BY price DESC
LIMIT 1;
```

In [ ]:
s = select([shop.c.article, shop.c.dealer, shop.c.price]).\
        order_by(desc(shop.c.price)).limit(1)
query(s)

**Maximum of Column per Group**

```sql
SELECT article, MAX(price) AS price
FROM   shop
GROUP BY article
ORDER BY article;
```

In [ ]:
s = select([shop.c.article, func.max(shop.c.price).label('price')]).\
        group_by(shop.c.article).\
        order_by(shop.c.article)
query(s)

In [23]:
conn.close()

In [24]:
engine = create_engine('mysql+pymysql://root:mysqlpass@localhost', pool_recycle=3600)
# engine = create_engine('mysql+pymysql://root:mysqlpass@localhost/menagerie', pool_recycle=3600)
conn = engine.connect()

query_in: SHOW VARIABLES LIKE 'sql_mode'
args: {}
eargs: {}
query_out: SHOW VARIABLES LIKE 'sql_mode'
query_in: SHOW VARIABLES LIKE 'lower_case_table_names'
args: {}
eargs: {}
query_out: SHOW VARIABLES LIKE 'lower_case_table_names'
query_in: SELECT DATABASE()
args: {}
eargs: {}
query_out: SELECT DATABASE()
query_in: show collation where `Charset` = 'utf8mb4' and `Collation` = 'utf8mb4_bin'
args: {}
eargs: {}
query_out: show collation where `Charset` = 'utf8mb4' and `Collation` = 'utf8mb4_bin'
query_in: SELECT CAST('test plain returns' AS CHAR(60)) AS anon_1
args: {}
eargs: {}
query_out: SELECT CAST('test plain returns' AS CHAR(60)) AS anon_1
query_in: SELECT CAST('test unicode returns' AS CHAR(60)) AS anon_1
args: {}
eargs: {}
query_out: SELECT CAST('test unicode returns' AS CHAR(60)) AS anon_1
query_in: SELECT CAST('test collated returns' AS CHAR CHARACTER SET utf8mb4) COLLATE utf8mb4_bin AS anon_1
args: {}
eargs: {}
query_out: SELECT CAST('test collated returns' AS CHAR CHARACTER SET utf8mb4) COLLATE utf8mb4_bin AS anon_1

In [27]:
insert_list = [(43, 'F', 2.37),(22, 'O', 2.35)]

tablename = 'menagerie.shop'
schema, table_name = tablename.split('.')
meta = MetaData()
shop = Table(table_name, meta, autoload=True, autoload_with=engine, schema=schema)

insert_list = [{col: data for col, data in zip(shop.c.keys(), row)} for row in insert_list]
print(insert_list)
#result = conn.execute(shop.insert(), insert_list)

query_in: SHOW CREATE TABLE `menagerie`.`shop`
args: {}
eargs: {}
query_out: SHOW CREATE TABLE `menagerie`.`shop`
[{'article': 43, 'dealer': 'F', 'price': 2.37}, {'article': 22, 'dealer': 'O', 'price': 2.35}]

In [33]:
tablename = 'menagerie.kmeans_us_arrests_data'
schema, table_name = tablename.split('.')

df_train = pd.read_sql_table(table_name, engine, schema=schema)
print(the_frame)

query_in: SHOW FULL TABLES FROM `menagerie`
args: {}
eargs: {}
query_out: SHOW FULL TABLES FROM `menagerie`
query_in: SHOW FULL TABLES FROM `menagerie`
args: {}
eargs: {}
query_out: SHOW FULL TABLES FROM `menagerie`
query_in: SHOW CREATE TABLE `menagerie`.`kmeans_us_arrests_data`
args: {}
eargs: {}
query_out: SHOW CREATE TABLE `menagerie`.`kmeans_us_arrests_data`
query_in: SELECT menagerie.kmeans_us_arrests_data.sno, menagerie.kmeans_us_arrests_data.state, menagerie.kmeans_us_arrests_data.murder, menagerie.kmeans_us_arrests_data.assault, menagerie.kmeans_us_arrests_data.urban_pop, menagerie.kmeans_us_arrests_data.rape
FROM menagerie.kmeans_us_arrests_data
args: {}
eargs: {}
query_out: SELECT menagerie.kmeans_us_arrests_data.sno, menagerie.kmeans_us_arrests_data.state, menagerie.kmeans_us_arrests_data.murder, menagerie.kmeans_us_arrests_data.assault, menagerie.kmeans_us_arrests_data.urban_pop, menagerie.kmeans_us_arrests_data.rape
FROM menagerie.kmeans_us_arrests_data
    sno           state  murder  assault  urban_pop  rape
0     1         Alabama    13.2    236.0         58  21.2
1     2          Alaska    10.0    263.0         48  44.5
2     3         Arizona     8.1    294.0         80  31.0
3     4        Arkansas     8.8    190.0         50  19.5
4     5      California     9.0    276.0         91  40.6
5     6        Colorado     7.9    204.0         78  38.7
6     7     Connecticut     3.3    110.0         77  11.1
7     8        Delaware     5.9    238.0         72  15.8
8     9         Florida    15.4    335.0         80  31.9
9    10         Georgia    17.4    211.0         60  25.8
10   11          Hawaii     5.3     46.0         83  20.2
11   12           Idaho     2.6    120.0         54  14.2
12   13        Illinois    10.4    249.0         83  24.0
13   14         Indiana     7.2    113.0         65  21.0
14   15            Iowa     2.2     56.0         57  11.3
15   16          Kansas     6.0    115.0         66  18.0
16   17        Kentucky     9.7    109.0         52  16.3
17   18       Louisiana    15.4    249.0         66  22.2
18   19           Maine     2.1     83.0         51   7.8
19   20        Maryland    11.3    300.0         67  27.8
20   21   Massachusetts     4.4    149.0         85  16.3
21   22        Michigan    12.1    255.0         74  35.1
22   23       Minnesota     2.7     72.0         66  14.9
23   24     Mississippi    16.1    259.0         44  17.1
24   25        Missouri     9.0    178.0         70  28.2
25   26         Montana     6.0    109.0         53  16.4
26   27        Nebraska     4.3    102.0         62  16.5
27   28          Nevada    12.2    252.0         81  46.0
28   29   New Hampshire     2.1     57.0         56   9.5
29   30      New Jersey     7.4    159.0         89  18.8
30   31      New Mexico    11.4    285.0         70  32.1
31   32        New York    11.1    254.0         86  26.1
32   33  North Carolina    13.0    337.0         45  16.1
33   34    North Dakota     0.8     45.0         44   7.3
34   35            Ohio     7.3    120.0         75  21.4
35   36        Oklahoma     6.6    151.0         68  20.0
36   37          Oregon     4.9    159.0         67  29.3
37   38    Pennsylvania     6.3    106.0         72  14.9
38   39    Rhode Island     3.4    174.0         87   8.3
39   40  South Carolina    14.4    279.0         48  22.5
40   41    South Dakota     3.8     86.0         45  12.8
41   42       Tennessee    13.2    188.0         59  26.9
42   43           Texas    12.7    201.0         80  25.5
43   44            Utah     3.2    120.0         80  22.9
44   45         Vermont     2.2     48.0         32  11.2
45   46        Virginia     8.5    156.0         63  20.7
46   47      Washington     4.0    145.0         73  26.2
47   48   West Virginia     5.7     81.0         39   9.3
48   49       Wisconsin     2.6     53.0         66  10.8
49   50         Wyoming     6.8    161.0         60  15.6

In [34]:
print("\nHead(10) of Train data:")
print(df_train.head(10))

Head(10) of Train data:
   sno        state  murder  assault  urban_pop  rape
0    1      Alabama    13.2    236.0         58  21.2
1    2       Alaska    10.0    263.0         48  44.5
2    3      Arizona     8.1    294.0         80  31.0
3    4     Arkansas     8.8    190.0         50  19.5
4    5   California     9.0    276.0         91  40.6
5    6     Colorado     7.9    204.0         78  38.7
6    7  Connecticut     3.3    110.0         77  11.1
7    8     Delaware     5.9    238.0         72  15.8
8    9      Florida    15.4    335.0         80  31.9
9   10      Georgia    17.4    211.0         60  25.8

In [ ]:
# A dictionary to get 'sno' to 'state' mapping. Required for plotting.
df1 = df_train.select(['sno', 'state'])

In [5]:
insp = inspect(engine)
dbs = insp.get_schema_names()
print(dbs)

['information_schema', 'menagerie', 'mysql', 'performance_schema', 'sys']

In [7]:
insp.get_table_names(schema='menagerie')

['event', 'kmeans_us_arrests_data', 'pet', 'shop']

In [8]:
insp.get_table_comment('kmeans_us_arrests_data', schema='menagerie')

{'text': None}

In [9]:
insp.get_columns('kmeans_us_arrests_data', schema='menagerie')

[{'name': 'sno',
  'type': INTEGER(display_width=11),
  'default': None,
  'comment': None,
  'nullable': True,
  'autoincrement': False},
 {'name': 'state',
  'type': VARCHAR(length=30),
  'default': None,
  'comment': None,
  'nullable': True},
 {'name': 'murder',
  'type': DOUBLE(asdecimal=True),
  'default': None,
  'comment': None,
  'nullable': True},
 {'name': 'assault',
  'type': DOUBLE(asdecimal=True),
  'default': None,
  'comment': None,
  'nullable': True},
 {'name': 'urban_pop',
  'type': INTEGER(display_width=11),
  'default': None,
  'comment': None,
  'nullable': True,
  'autoincrement': False},
 {'name': 'rape',
  'type': DOUBLE(asdecimal=True),
  'default': None,
  'comment': None,
  'nullable': True}]